       IDENTIFICATION DIVISION.
       PROGRAM-ID. ACCTVIEW.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ACCTFILE-FILE ASSIGN TO ACCTDAT
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD  ACCTFILE-FILE.
       01  FD-ACCTFILE-REC.
           05 FD-ACCT-ID                 PIC 9(11).
       WORKING-STORAGE SECTION.
       01  WS-ID                        PIC 9(11).
       PROCEDURE DIVISION.
       1000-MAIN.
           READ ACCTFILE-FILE INTO FD-ACCTFILE-REC.
           MOVE FD-ACCT-ID TO WS-ID.
           GOBACK.
