       IDENTIFICATION DIVISION.
       PROGRAM-ID. ACCTREAD.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ACCTFILE-FILE ASSIGN TO ACCTDAT
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS ACCTFILE-STATUS.
           SELECT OUT-FILE ASSIGN TO OUTFILE
                  ORGANIZATION IS SEQUENTIAL
                  ACCESS MODE IS SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD  ACCTFILE-FILE.
       01  FD-ACCTFILE-REC.
           05 FD-ACCT-ID                 PIC 9(11).
           05 FD-ACCT-DATA               PIC X(289).
       FD  OUT-FILE.
       01  OUT-ACCT-REC.
           05  OUT-ACCT-ID               PIC 9(11).
           05  OUT-ACCT-BAL              PIC S9(10)V99 USAGE COMP-3.
       WORKING-STORAGE SECTION.
       01  ACCTFILE-STATUS              PIC X(02).
       01  WS-ACCT-ID                   PIC 9(11).
       PROCEDURE DIVISION.
       1000-MAIN.
           PERFORM 2000-READ-ACCT.
           GO TO 9000-EXIT.
       2000-READ-ACCT.
           READ ACCTFILE-FILE INTO FD-ACCTFILE-REC.
           MOVE FD-ACCT-ID TO OUT-ACCT-ID.
           WRITE OUT-ACCT-REC.
       9000-EXIT.
           GOBACK.
